import Foundation


//1. შექმენით სამი Int ტიპის ცვლადი, მიანიჭეთ მათ მნიშვნელობა და დაბეჭდეთ მათი ნამრავლი.
var number1:Int = 4
var number2:Int = 6
var number3:Int = 2
print(number1*number2*number3)

//2. შექმენით int ტიპის ცვლადი, მიანიჭეთ მას მნიშვნელობა და შეამოწმეთ ეს რიცხვი ლუწია თუ კენტი ტერნარი ოპერატორით.
var number4 = 53
print(number4 % 2 == 1 ? "Odd":"Even")

//3. შექმენით optional String-ის ტიპის და მიანიჭეთ თქვენი სახელის მნიშვნელობა. If let-ის მეშვეობით გაუკეთეთ unwrap და მნიშვნელობა დაპრინტეთ
var name:String? = "Tornike"
if let name{
    print(name)
}

//4. შექმენით ცვლადი სახელად isRaining ბულეანის ტიპის და მიანიჭეთ თქვენთვის სასურველი მნიშვნელობა. If-else-ის მეშვეობით შეამოწმეთ თუ მნიშვნელობა მიიღებს true მნიშვნელობას დაბეჭდეთ “ქოლგის წაღება არ დამავიწყდეს”, სხვა შემთხვევაში “დღეს ქოლგა არ დამჭირდება”.
var isRaining:Bool = true
if isRaining == true{
    print("ქოლგის წაღება არ დამავიწყდეს")
}else{"დღეს ქოლგა არ დამჭირდება"}

//5. შექმენით ორი int ტიპის ცვლადი a & b და მიანიჭეთ სასურველი რიცხვები. If-else-ით შეამოწმეთ თუ a მეტია b-ზე დაბეჭდეთ “a მეტია”,  სხვა შემთხვევაში “b მეტია”
var a:Int = 5
var b:Int = 4

if a > b {
    print("a მეტია")
}else{
    print("b მეტია")
}

//6. შექმენით მუდმივა Character ტიპის და მიანიჭეთ თქვენი სახელის პირველი ასოს მნიშვნელობა.
let firstCharOfName:Character = "T"

//7. მოცემულია ორნიშნა რიცხვი, გაიგეთ არის თუ არა ერთიდაიმავე ციფრისგან შემდგარი

var number5 = 11
// number5/(number5%10) == 11 თუ რიცხვი იყოფა მის 10 ზე გაყოფისას მიღებულ ნაშთზე და უდრის 11-ს ნიშნავს რომ ეს რიცხვი ერთნაირი ციფრებისგანაა შედგენილი
// number5%10 != 0 დაჰენდლავ ზეროდივიჟენ ერორებს
if number5%10 != 0 && number5/(number5%10) == 11 {
    print("ერთიდაიგივე ციფრისგანაა შედგენილი")
}else{
    print("სხვადასხვა ციფრისგანაა შედგენილი")
}

//8. აიღეთ ცვლადი numberOfMonths მიანიჭეთ მნიშვნელობა და იმის მიხედვით თუ მერამდენე თვეა დაბეჭდეთ ის (გაზაფხული, ზაფხული, შემოდგომა, ზამთარი) შესაბამისად.
var numberOfMonths:Int = 10
if numberOfMonths >= 3 && numberOfMonths <= 5  {
    print("გაზაფხული")
}else if numberOfMonths >= 6 && numberOfMonths <= 8{
    print("ზაფხული")
}else if numberOfMonths >= 9 && numberOfMonths <= 11{
    print("შემოდგომა")
}else if numberOfMonths == 12 || numberOfMonths == 1 || numberOfMonths == 2{
    print("ზამთარი")
}

//9. შექმენით მთელი რიცხვის მქონე ცვლადი. თუ ეს ცვლადი იყოფა 3-ზე, დაბეჭდეთ “იყოფა 3-ზე”, თუ ეს ცვლადი იყოფა 4-ზე დაბეჭდეთ “იყოფა 4-ზე”, თუ იყოფა ორივეზე დაბეჭდეთ “იყოფა 3-ზე და 4-ზე”
var number6: Int = 12
if number6 % 3 == 0  && number6 % 4 == 0  {
    print("იყოფა 3-ზე და 4-ზე")
}else if number6 % 3 == 0  {
    print("იყოფა 3-ზე")
}else if number6 % 4 == 0  {
    print("იყოფა 4-ზე")
}else{
    print("არ იყოფა არც 3 ზე და არც 4 ზე")
}

//10. შექმენით ორი რიცხვითი ცვლადი num1, num2 და რაიმე String ტიპის ცვლადი რომელსაც ტერნარული ოპერატორის საშუალებით მიანიჭებთ “თანაბრად დაშორებულია ნულიდან” / “არ არის თანაბრად დაშორებული ნულიდან” შესაბამის მნიშვნელობას რომელსაც აკმაყოფილებს მოცემული ორი ცვლადი

var num1:Int = -41
var num2:Int = 41

print(abs(num1) == abs(num2) ? "თანაბრად დაშორებულია ნულიდან" : "არ არის თანაბრად დაშორებული ნულიდან" )



print(num1-num2)
